var eventMaxAmtCode = {
  name: '历史最大逾期金额（元）',
  'M01': '0~500',
  'M02': '500~1000',
  'M03': '1000~2000',
  'M04': '2000~3000',
  'M05': '3000~4000',
  'M06': '4000~6000',
  'M07': '6000~8000',
  'M08': '8000~10000',
  'M09': '10000~15000',
  'M10': '15000~20000',
  'M11': '20000~25000',
  'M12': '25000~30000',
  'M13': '30000~40000',
  'M14': '大于40000'
};
var HY_DATA = {
  status: {
    name: '异议状态',
    '0': '原始状态',
    '1': '用户有异议，信息核查中',
    '2': '核查完毕，信息无误',
    '3': '核查完毕，信息已修改',
    '5': '用户对此记录有异议，但异议主张经核查未获支持'
  },
  statement: {
    name: '异议声明'  // 异议状态为5时，用户填写的异议声明，用于描述原因
  },
  settlement: {
    name: '当前状态',
    'T': '当前不逾期',
    'F': '当前逾期'
  },
  level: {
    name: '风险等级',
    '1': '低风险',
    '2': '中风险',
    '3': '高风险'
  },
  refreshTime: {
    name: '信息更新时间'
  },
  bizCode: {
    name: '行业类型编码',
    'AA': {
      name: '金融信贷类',
      type: {
        name: '风险类型编码',
        'AA001': {
          name: '逾期未还款',
          code: {
            name: '历史最大逾期天数',
            'AA001001': '逾期1-30天',
            'AA001002': '逾期31-60天',
            'AA001003': '逾期61-90天',
            'AA001004': '逾期91-120天',
            'AA001005': '逾期121-150天',
            'AA001006': '逾期151-180天',
            'AA001007': '逾期180天以上',
            'AA001010': '逾期1-30天',
            'AA001011': '逾期31-60天',
            'AA001012': '逾期61-90天',
            'AA001013': '逾期91-120天',
            'AA001014': '逾期121-150天',
            'AA001015': '逾期151-180天',
            'AA001016': '逾期180天以上'
          },
          extendInfo: { // [{key: 'event_end_time_desc', value: '2017-09', description: '违约时间'},...]
            'event_max_amt_code': eventMaxAmtCode,
            'event_end_time_desc': {
              name: '违约时间'
            }
          }
        },
        'AA002': {
          name: '套现',
          code: {
            'AA002001': '严重逾期且套现（通过交易类平台套现且长期未还款）'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '处罚时间'
            }
          }
        }
      }
    },
    'AB': {
      name: '公检法',
      type: {
        'AB001': {
          name: '被执行人',
          code: {
            'AB001001': '失信被执行人（亦称“老赖”）',
            'AB001002': '被执行人'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '案件发布时间'
            },
            'gist_cid': {
              name: '执行依据文号'
            },
            'gist_unit': {
              name: '作出执行依据单位'
            },
            'duty': {
              name: '法律生效文书确定的义务'
            },
            'performance_new': {
              name: '被执行人的履行情况'
            },
            'performed_part': {
              name: '已履行部分'
            },
            'unperform_part': {
              name: '未履行部分'
            }
          }
        }
      }
    },
    'AC': {
      name: '支付行业',
      type: {
        'AC001': {
          name: '盗卡者/盗卡者同伙',
          code: {
            'AC001001': '盗卡者/盗卡者同伙'
          }
        },
        'AC002': {
          name: '欺诈者/欺诈同伙',
          code: {
            'AC002001': '欺诈者/欺诈同伙'
          }
        },
        'AC003': {
          name: '盗用操作/盗用者同伙',
          code: {
            'AC003001': '盗用操作/盗用者同伙'
          }
        },
        'AC004': {
          name: '盗用支出/盗用者同伙',
          code: {
            'AC004001': '盗用支出/盗用者同伙'
          }
        },
        'AC005': {
          name: '骗赔',
          code: {
            'AC005001': '骗赔'
          }
        },
        'AC007': {
          name: '案件库黑名单',
          code: {
            'AC007001': '营销作弊名单'
          }
        }
      }
    },
    'AD': {
      name: '出行行业',
      type: {
        'AD001': {
          name: '汽车租赁逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AD001001': '逾期1-7天',
            'AD001002': '逾期8-14天',
            'AD001003': '逾期15-30天',
            'AD001004': '逾期31-60天',
            'AD001005': '逾期61-90天',
            'AD001006': '逾期91-120天',
            'AD001007': '逾期121-150天',
            'AD001008': '逾期151-180天',
            'AD001009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD002': {
          name: '汽车租赁逾期未还车',
          code: {
            name: '历史最大逾期天数',
            'AD002001': '逾期1-7天',
            'AD002002': '逾期8-14天',
            'AD002003': '逾期15-30天',
            'AD002004': '逾期31-60天',
            'AD002005': '逾期61-90天',
            'AD002006': '逾期91-120天',
            'AD002007': '逾期121-150天',
            'AD002008': '逾期151-180天',
            'AD002009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD003': {
          name: '汽车租赁违章逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AD003001': '逾期1-7天',
            'AD003002': '逾期8-14天',
            'AD003003': '逾期15-30天',
            'AD003004': '逾期31-60天',
            'AD003005': '逾期61-90天',
            'AD003006': '逾期91-120天',
            'AD003007': '逾期121-150天',
            'AD003008': '逾期151-180天',
            'AD003009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD004': {
          name: '汽车租赁其他逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AD004001': '逾期1-7天',
            'AD004002': '逾期8-14天',
            'AD004003': '逾期15-30天',
            'AD004004': '逾期31-60天',
            'AD004005': '逾期61-90天',
            'AD004006': '逾期91-120天',
            'AD004007': '逾期121-150天',
            'AD004008': '逾期151-180天',
            'AD004009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD005': {
          name: '单车租赁逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AD005001': '逾期1-7天',
            'AD005002': '逾期8-14天',
            'AD005003': '逾期15-30天',
            'AD005004': '逾期31-60天',
            'AD005005': '逾期61-90天',
            'AD005006': '逾期91-120天',
            'AD005007': '逾期121-150天',
            'AD005008': '逾期151-180天',
            'AD005009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD006': {
          name: '单车租赁逾期未还车',
          code: {
            name: '历史最大逾期天数',
            'AD006001': '逾期1-7天',
            'AD006002': '逾期8-14天',
            'AD006003': '逾期15-30天',
            'AD006004': '逾期31-60天',
            'AD006005': '逾期61-90天',
            'AD006006': '逾期91-120天',
            'AD006007': '逾期121-150天',
            'AD006008': '逾期151-180天',
            'AD006009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD007': {
          name: '交通工具乘用费逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AD007001': '逾期1-7天',
            'AD007002': '逾期8-14天',
            'AD007003': '逾期15-30天',
            'AD007004': '逾期31-60天',
            'AD007005': '逾期61-90天',
            'AD007006': '逾期91-120天',
            'AD007007': '逾期121-150天',
            'AD007008': '逾期151-180天',
            'AD007009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD008': {
          name: '路桥费逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AD008001': '逾期1-7天',
            'AD008002': '逾期8-14天',
            'AD008003': '逾期15-30天',
            'AD008004': '逾期31-60天',
            'AD008005': '逾期61-90天',
            'AD008006': '逾期91-120天',
            'AD008007': '逾期121-150天',
            'AD008008': '逾期151-180天',
            'AD008009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD009': {
          name: '停车费逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AD009001': '逾期1-7天',
            'AD009002': '逾期8-14天',
            'AD009003': '逾期15-30天',
            'AD009004': '逾期31-60天',
            'AD009005': '逾期61-90天',
            'AD009006': '逾期91-120天',
            'AD009007': '逾期121-150天',
            'AD009008': '逾期151-180天',
            'AD009009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AD010': {
          name: '相关违约',
          code: {
            'AD010001': '相关违约'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            }
          }
        }
      }
    },
    'AE': {
      name: '酒店行业',
      type: {
        'AE001': {
          name: '逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AE001001': '逾期1-7天',
            'AE001002': '逾期8-14天',
            'AE001003': '逾期15-30天',
            'AE001004': '逾期31-60天',
            'AE001005': '逾期61-90天',
            'AE001006': '逾期91-120天',
            'AE001007': '逾期121-150天',
            'AE001008': '逾期151-180天',
            'AE001009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        }
      }
    },
    'AF': {
      name: '电商行业',
      type: {
        'AF001': {
          name: '虚假交易',
          code: {
            'AF001001': '炒信（买家通过虚假购买商品等形式抬高商品销量和评级，误导真实消费者）'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '处罚时间'
            }
          }
        },
        'AF002': {
          name: '恶意差评',
          code: {
            'AF002001': '恶意差评（买家对卖家售卖的商品或服务进行恶意差评，并以此要求卖家给予经济补偿）'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '处罚时间'
            }
          }
        },
        'AF003': {
          name: '涉嫌售假',
          code: {
            'AF003001': '涉嫌售假（卖家涉嫌销售假货）'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '处罚时间'
            }
          }
        },
        'AF004': {
          name: '卖家套现',
          code: {
            'AF004001': '卖家套现（卖家为客户提供套现的服务）'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '处罚时间'
            }
          }
        },
        'AF005': {
          name: '逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AF005001': '逾期1-7天',
            'AF005002': '逾期8-14天',
            'AF005003': '逾期15-30天',
            'AF005004': '逾期31-60天',
            'AF005005': '逾期61-90天',
            'AF005006': '逾期91-120天',
            'AF005007': '逾期121-150天',
            'AF005008': '逾期151-180天',
            'AF005009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '处罚时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        }
      }
    },
    'AG': {
      name: '租房行业',
      type: {
        'AG001': {
          name: '房租逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AG001001': '逾期1-7天',
            'AG001002': '逾期8-14天',
            'AG001003': '逾期15-30天',
            'AG001004': '逾期31-60天',
            'AG001005': '逾期61-90天',
            'AG001006': '逾期91-120天',
            'AG001007': '逾期121-150天',
            'AG001008': '逾期151-180天',
            'AG001009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AG002': {
          name: '杂费逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AG002001': '逾期1-7天',
            'AG002002': '逾期8-14天',
            'AG002003': '逾期15-30天',
            'AG002004': '逾期31-60天',
            'AG002005': '逾期61-90天',
            'AG002006': '逾期91-120天',
            'AG002007': '逾期121-150天',
            'AG002008': '逾期151-180天',
            'AG002009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AG003': {
          name: '其他违约未付款',
          code: {
            name: '历史最大逾期天数',
            'AG003001': '逾期1-7天',
            'AG003002': '逾期8-14天',
            'AG003003': '逾期15-30天',
            'AG003004': '逾期31-60天',
            'AG003005': '逾期61-90天',
            'AG003006': '逾期91-120天',
            'AG003007': '逾期121-150天',
            'AG003008': '逾期151-180天',
            'AG003009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AG004': {
          name: '租客其他违约',
          code: {
            'AG004001': '改变房屋用途（擅自改变房屋用途，比如民宅改为商用）',
            'AG004002': '拆改房屋结构 （擅自拆改房屋固定结构，比如墙身）',
            'AG004003': '屋内非法活动 （比如在房屋内吸毒）',
            'AG004004': '扰民被投诉 （比如制造噪音，被邻居投诉）',
            'AG004005': '擅自转租 （比如擅自转租整个房屋，或部分房间）'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            }
          }
        },
        'AG005': {
          name: '非正常解约',
          code: {
            'AG005001': '违约被清退 （如因违约行为被强制清退）',
            'AG005002': '违约并失联（如逃租）'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            }
          }
        }
      }
    },
    'AH': {
      name: '运营商行业',
      type: {
        'AH001': {
          name: '逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AH001001': '逾期1-30天',
            'AH001002': '逾期31-60天',
            'AH001003': '逾期61-90天',
            'AH001004': '逾期91-120天',
            'AH001005': '逾期121-150天',
            'AH001006': '逾期151-180天',
            'AH001007': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        }
      }
    },
    'AI': {
      name: '保险行业',
      type: {
        'AI003': {
          name: '保证保险出险',
          code: {
            name: '历史最大逾期天数',
            'AI003001': '逾期1-30天',
            'AI003002': '逾期31-60天',
            'AI003003': '逾期61-90天',
            'AI003004': '逾期91-120天',
            'AI003005': '逾期121-150天',
            'AI003006': '逾期151-180天',
            'AI003007': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        }
      }
    },
    'AK': {
      name: '租赁行业',
      type: {
        'AK001': {
          name: '逾期未付款',
          code: {
            name: '历史最大逾期天数',
            'AK001001': '逾期1-7天',
            'AK001002': '逾期8-14天',
            'AK001003': '逾期15-30天',
            'AK001004': '逾期31-60天',
            'AK001005': '逾期61-90天',
            'AK001006': '逾期91-120天',
            'AK001007': '逾期121-150天',
            'AK001008': '逾期151-180天',
            'AK001009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        },
        'AK002': {
          name: '逾期未归还',
          code: {
            name: '历史最大逾期天数',
            'AK002001': '逾期1-7天',
            'AK002002': '逾期8-14天',
            'AK002003': '逾期15-30天',
            'AK002004': '逾期31-60天',
            'AK002005': '逾期61-90天',
            'AK002006': '逾期91-120天',
            'AK002007': '逾期121-150天',
            'AK002008': '逾期151-180天',
            'AK002009': '逾期180天以上'
          },
          extendInfo: {
            'event_end_time_desc': {
              name: '违约时间'
            },
            'event_max_amt_code': eventMaxAmtCode
          }
        }
      }
    }
  }
};
